TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/CarJourneyPlannerSynchronous/V1/PlanCarJourney - Location - Postcode (No parameters).xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <PlanCarJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.CarJourneyPlannerSynchronous.V1">
      <transactionId>testCarJourneyPlanner</transactionId>
	  <request>
		<JourneyRequests>
			<JourneyRequest>
			  <JourneyRequestId>01</JourneyRequestId>
			  <OriginLocation>
				<Description>NG9 1LA</Description>
				<Type>Postcode</Type>
				<Postcode>NG9 1LA</Postcode>
			  </OriginLocation>
			  <DestinationLocation>
				<Description>LE5 1QS</Description>
				<Type>Postcode</Type>
				<Postcode>LE5 1QS</Postcode>
			  </DestinationLocation>
			  <OutwardDateTime>2014-04-18T18:35:00.0000+01:00</OutwardDateTime>
			  <ReturnDateTime>2014-04-19T19:35:26.2939351+01:00</ReturnDateTime>
			  <OutwardArriveBefore>false</OutwardArriveBefore>
			  <ReturnArriveBefore>false</ReturnArriveBefore>
			  <IsReturnRequired>false</IsReturnRequired>
			</JourneyRequest>
		</JourneyRequests>
      </request>
    </PlanCarJourney>
  </soap:Body>
</soap:Envelope>
